# Titanic Wrangling

In this practice activity you'll continue to work with the titanic dataset in ways that flex what you've learned about both data wrangling and data visualization.

In [3]:
import pandas as pd
data_dir = "https://dlsun.github.io/pods/data/"
df_titanic = pd.read_csv(data_dir + "titanic.csv")
df_titanic.head()

                             name  gender   age  ...  ticketno   fare survived
0             Abbing, Mr. Anthony    male  42.0  ...    5547.0   7.11        0
1       Abbott, Mr. Eugene Joseph    male  13.0  ...    2673.0  20.05        0
2     Abbott, Mr. Rossmore Edward    male  16.0  ...    2673.0  20.05        0
3  Abbott, Mrs. Rhoda Mary 'Rosa'  female  39.0  ...    2673.0  20.05        1
4     Abelseth, Miss. Karen Marie  female  16.0  ...  348125.0   7.13        1

[5 rows x 9 columns]

## 1. Filter the data to include passengers only. Calculate the joint distribution (cross-tab) between a passenger's class and where they embarked.

In [10]:
# Code here
df_titanic["type"] = df_titanic["class"].map({
    "1st": "passenger",
    "2nd": "passenger", 
    "3rd": "passenger", 
    "victualling crew": "crew", 
    "engineering crew": "crew", 
    "deck crew": "crew"
})
df_titanic

                                name  gender   age  ...   fare survived       type
0                Abbing, Mr. Anthony    male  42.0  ...   7.11        0  passenger
1          Abbott, Mr. Eugene Joseph    male  13.0  ...  20.05        0  passenger
2        Abbott, Mr. Rossmore Edward    male  16.0  ...  20.05        0  passenger
3     Abbott, Mrs. Rhoda Mary 'Rosa'  female  39.0  ...  20.05        1  passenger
4        Abelseth, Miss. Karen Marie  female  16.0  ...   7.13        1  passenger
...                              ...     ...   ...  ...    ...      ...        ...
2202                Wynn, Mr. Walter    male  41.0  ...    NaN        1       crew
2203             Yearsley, Mr. Harry    male  40.0  ...    NaN        1       crew
2204        Young, Mr. Francis James    male  32.0  ...    NaN        0       crew
2205             Zanetti, Sig. Minio    male  20.0  ...    NaN        0        NaN
2206              Zarracchi, Sig. L.    male  26.0  ...    NaN        0        NaN

[2207 rows x 10 columns]

In [12]:
# filter by passengers
df_passengers = df_titanic[df_titanic["type"] == "passenger"]
df_passengers

                                name  gender  ...  survived       type
0                Abbing, Mr. Anthony    male  ...         0  passenger
1          Abbott, Mr. Eugene Joseph    male  ...         0  passenger
2        Abbott, Mr. Rossmore Edward    male  ...         0  passenger
3     Abbott, Mrs. Rhoda Mary 'Rosa'  female  ...         1  passenger
4        Abelseth, Miss. Karen Marie  female  ...         1  passenger
...                              ...     ...  ...       ...        ...
1314          Yvois, Miss. Henriette  female  ...         0  passenger
1315       Zakarian, Mr. Mapriededer    male  ...         0  passenger
1316             Zakarian, Mr. Ortin    male  ...         0  passenger
1317               Zenni, Mr. Philip    male  ...         1  passenger
1318             Zimmermann, Mr. Leo    male  ...         0  passenger

[1317 rows x 10 columns]

In [13]:
# cross- tab for passengers class and where they embarked
pd.crosstab(df_passengers["class"], df_passengers["embarked"])

embarked  B    C    Q    S
class
1st       3  143    3  175
2nd       6   26    7  245
3rd       0  102  113  494

## 2. Using the joint distribution that calculated above, calculate the following:

* the conditional distribution of their class given where they embarked
* the conditional distribution of where they embarked given their class

Use the conditional distributions that you calculate to answer the following quesitons:

* What proportion of 3rd class passengers embarked at Southampton?
* What proportion of Southampton passengers were in 3rd class?

In [22]:
# Code here
# class given where they embarked, same as where they embarked given class
pd.crosstab(df_passengers["class"], df_passengers["embarked"], normalize = True)

embarked         B         C         Q         S
class
1st       0.002278  0.108580  0.002278  0.132878
2nd       0.004556  0.019742  0.005315  0.186029
3rd       0.000000  0.077449  0.085801  0.375095

The proportion of 3rd class passengers embarked at Southampton is 0.375096. 
The proportion of Southampton passengers were in 3rd class in 0.375096.

## 3. Make a visualization showing the distribution of a passenger's class, given where they embarked.

Discuss the pros and cons of using this visualization versus the distributions you calculated before, to answer the previous questions.

In [ ]:
# Code here